app/controllers/userlistings_controller.rb

SELECT "listings".* FROM "listings"
SELECT "userlistings".* FROM "userlistings"
---
    def index
        userlistings = Userlisting.all